
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Semantic Dreamer</title>
  <meta name="author" content="Matthias Geisler">

  
  <meta name="description" content="&#8230;yes? So take a look here. :-)
">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  
  <link rel="canonical" href="http://semanticdreamer.com/page/10">
  <link href="/favicon.png" rel="icon">
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="/javascripts/ender.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="/atom.xml" rel="alternate" title="Semantic Dreamer" type="application/atom+xml">
  <!--Fonts from Google"s Web font directory at http://google.com/webfonts -->
<link href="http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">
<link href="http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">

  

</head>

<body   >
  <header role="banner"><hgroup>
  <h1><a href="/">Semantic Dreamer</a></h1>
  
    <h2>A little something on the internet.</h2>
  
</hgroup>

</header>
  <nav role="navigation"><ul class="subscription" data-subscription="rss">
  <li><a href="/atom.xml" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
  
</ul>
  
<form action="http://google.com/search" method="get">
  <fieldset role="search">
    <input type="hidden" name="q" value="site:semanticdreamer.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Search"/>
  </fieldset>
</form>
  
<ul class="main-navigation">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives/">Archives</a></li>
  <li><a href="/semantic-web-schnell-und-kompakt/">Semantic Web Buch</a></li>
  <li><a href="/about/">About</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div class="blog-index">
  
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2006/12/05/ever-wonder-where-google-gets-all-that-gmail-storage-space/">Ever wonder where Google gets all that Gmail storage space?</a></h1>
    
    
      <p class="meta">
        








  


<time datetime="2006-12-05T00:00:00+00:00" pubdate data-updated="true">Dec 5<span>th</span>, 2006</time>
        
      </p>
    
  </header>


  <div class="entry-content"><p>&#8230;yes? So take a look <a href="http://www.imagehost.ro/viewer.php?img=2502113445678a36429d7.jpg">here</a>. :-)</p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2006/11/11/helsinki-complaints-choir/">helsinki complaints choir</a></h1>
    
    
      <p class="meta">
        








  


<time datetime="2006-11-11T00:00:00+00:00" pubdate data-updated="true">Nov 11<span>th</span>, 2006</time>
        
      </p>
    
  </header>


  <div class="entry-content">This <div style="display: inline;color:#000CED;"><u><a href="http://swissmiss.typepad.com/weblog/2006/11/helsinki_compla.html">helsinki complaints choir</a></u></div > made me smile today morning - always look on the bride side of live&#8230;:-)!:<br /><object height="350" width="425"><br />   <param name="movie" value="http://www.youtube.com/v/ATXV3DzKv68"><br />   <param name="wmode" value="transparent"><br />   <embed wmode="transparent" src="http://www.youtube.com/v/ATXV3DzKv68" type="application/x-shockwave-flash" height="350" width="425"></embed><br />  </object><br />(Via <div style="display: inline;color:#000CED;"><u><a href="http://swissmiss.typepad.com/weblog/">swissmiss</a></u></div >.)<br />
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2006/10/17/getting-connected-zune-vs-ipod-guess-who-is-the-winner/">Getting Connected: Zune vs. iPod - guess who is the winner?!</a></h1>
    
    
      <p class="meta">
        








  


<time datetime="2006-10-17T00:00:00+00:00" pubdate data-updated="true">Oct 17<span>th</span>, 2006</time>
        
      </p>
    
  </header>


  <div class="entry-content">The following quote - that I&#8217;ve read via <div style="display: inline;color:#000CED;"><u><a href="http://www.notio.com/">Michael J.&#8217;s Notio</a></u></div > (<div style="display: inline;color:#000CED;"><u><a href="http://www.msnbc.msn.com/id/15262121/site/newsweek/print/1/displaymode/1098/">Getting Connected</a></u></div >) - made me smile sooooo&#8230; much! Enjoy!<br />&#8220;Classic Steve Jobs <div style="display: inline;color:#000CED;"><u><a href="http://www.msnbc.msn.com/id/15262121/site/newsweek/print/1/displaymode/1098/">quote</a></u></div >:<br /><strong>Microsoft has announced its new iPod competitor, Zune. It says that this device is all about building communities. Are you worried?</strong><br />In a word, no. I&#8217;ve seen the demonstrations on the Internet about how you can find another person using a Zune and give them a song they can play three times. It takes forever. By the time you&#8217;ve gone through all that, the girl&#8217;s got up and left! You&#8217;re much better off to take one of your earbuds out and put it in her ear. Then you&#8217;re connected with about two feet of headphone cable.<br />The guy sure knows how to give good media.&#8221;
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2005/11/06/rapidweaver-a-powerful-new-website-creation-tool-for-everyone/">RapidWeaver - A Powerful New Website Creation Tool For Everyone</a></h1>
    
    
      <p class="meta">
        








  


<time datetime="2005-11-06T00:00:00+00:00" pubdate data-updated="true">Nov 6<span>th</span>, 2005</time>
        
      </p>
    
  </header>


  <div class="entry-content"><div style="display: inline;font:12px Verdana, serif; color:#0F0F0F;"><a href="http://www.realmacsoftware.com/rapidweaver/" rel="external">RapidWeaver</a></div ><div style="display: inline;font:12px Verdana, serif; color:#0F0F0F;"> is a next-generation web design application to help you create professional looking web sites in minutes. No knowledge of complex code is required, RapidWeaver will take care of all that for you. </div >
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2004/12/04/munchner-schlittenberge-der-blomberg/">Münchner Schlittenberge - Der Blomberg</a></h1>
    
    
      <p class="meta">
        








  


<time datetime="2004-12-04T00:00:00+00:00" pubdate data-updated="true">Dec 4<span>th</span>, 2004</time>
        
      </p>
    
  </header>


  <div class="entry-content">Wie und wo man(n) rund um M&uuml;nchen zum Winterrodeln gehen kann.<br /><br />Wir waren neulich beim Schlittenfahren auf der Winterrodelbahn am Blomberg. Was soll ich sagen: cool war&#8217;s&#8230; :-)) Da wir uns zun&auml;chst m&uuml;hsam die besten Winterrodelstrecken rund um M&uuml;nchen zusammensuchen mussten :-( habe ich hier f&uuml;r Euch zum einen die Winterrodelbahn am Blomberg vorgestellt und zum anderen interessante und hilfreiche Links rund um das Thema &#8220;Schlittenfahren rund um M&uuml;nchen&#8221; zusammengestellt (&#8230;bitte keine Kommentare zu der Fotoqualit&auml;t - ich wei&szlig; es selbst, hatte aber nur mein P800-Fotohandy dabei). Hope it helps&#8230;!<br /><br />Die Winterrodelbahn am Blomberg<br /><br />Die Anreise&#8230;<br /><br /><img class="imageStyle" alt="1_3_Fl2Tuj9F5x-228x" src="/rw-journal/files/mnchner-schlittenberge-der-blomberg_1.jpg" width="228" height="171"/><br />Die Talstation der Blomberg-Bahn.<br /><br />Der Blomberg liegt bei Bad T&ouml;lz. Aus M&uuml;nchen kommst Du entweder &uuml;ber die Salzburger-Autobahn A8, Ausfahrt &#8220;Holzkirchen&#8221; und dann die B318 oder die Garmischer-Autobahn A95, Ausfahrt Wolfratshausen, Seeshaupt oder Sindelsdorf nach Bad T&ouml;lz. In Bad T&ouml;lz dann einfach der Beschilderung &#8220;Blomberg-Bahn&#8221; folgen. Auf der Internetseite der Blomberg-Bahn findest Du einen n&uuml;tzlichen(!) Link zu einem Routenplaner von Map24.com.<br /><br />&#8230;der Aufstieg&#8230;<br /><br /><img class="imageStyle" alt="1_7_K31gdPRgfG-228x" src="/rw-journal/files/mnchner-schlittenberge-der-blomberg_2.jpg" width="228" height="171"/><br />Die Wirtschaftsstra&szlig;e zum Berggasthof &#8220;Blomberghaus&#8221;.<br /><br />Links neben der Talstation endet zum einen die Winterrodelbahn zum anderen beginnt hier die Wirtschaftsstra&szlig;e zum Berggasthof &#8220;Blomberghaus&#8221; welche geradezu zum Aufstieg einl&auml;dt - naja, mehr oder weniger&#8230; ;-).<br />Nein, wir nehmen *nicht* den Sessellift - vielleicht f&uuml;r die zweite Tour&#8230;<br />Der Aufstieg dauert bei durchschnittlicher Kondition 1,5 Stunden und ist f&uuml;r Jung und Alt gleicherma&szlig;en geeignet. Ganz ehrlich: wer da nicht raufkommt sollte *dringend* mal &uuml;ber seine k&ouml;rperliche Fitness nachdenken&#8230;<br /><br />&#8230;Unterwegs&#8230;<br /><br /><img class="imageStyle" alt="1_6_I7I23noLSa-228x" src="/rw-journal/files/mnchner-schlittenberge-der-blomberg_3.jpg" width="228" height="171"/><br />Unterwegs auf dem Wirtschaftsweg zum &#8220;Blomberghaus&#8221;.<br /><br />Irgendwann, auf dem Weg zu dem Berggasthof, stellt man(n) sich dann (doch) unweigerlich die Frage: &#8220;Warum haben wir eigentlich nicht den Sessellift genommen?&#8221; &#8230;aber dann siegt doch wieder das Wissen um das bevorstehende Erfolgserlebnis - naja, und dann ist da ja auch noch der Sieg &uuml;ber den inneren Schweinehund!<br /><br />&#8230;das Ziel?&#8230;<br /><br />Und dann, nach 1,5 Stunden - das Ziel?<br /><br /><img class="imageStyle" alt="1_4_7SQ3uFkJcf-228x" src="/rw-journal/files/mnchner-schlittenberge-der-blomberg_4.jpg" width="228" height="171"/><br />Das Gastst&auml;ttenschild des Berggasthof &#8220;Blomberghaus&#8221;.<br /><br />&#8230;Brotzeit&#8230;<br /><br /><img class="imageStyle" alt="1_5_T8xISbhFm8-228x" src="/rw-journal/files/mnchner-schlittenberge-der-blomberg_5.jpg" width="228" height="171"/><br />Der Berggasthof &#8220;Blomberghaus&#8221;.<br /><br />In dem &#8220;Blomberghaus&#8221; bekommt man neben deftiger bayerischer H&uuml;ttenkost (lecker und nicht zu teuer) auch des verdiente Glas &#8220;Manna&#8221;.<br />Hier kann man(n) sich auch Mut f&uuml;r die nun unweigerlich bevorstehende Talfahrt holen - in jedem Fall jedoch aufw&auml;rmen und die durchgeschwitzten Klamotten trocknen.<br /><br />&#8230;und schliesslich die Abfahrt :-))<br /><br /><img class="imageStyle" alt="1_2_iVkfUodEkR-228x" src="/rw-journal/files/mnchner-schlittenberge-der-blomberg_6.jpg" width="228" height="171"/><br />Auf der Winterrodelbahn am Blomberg.<br /><br />Dieses Foto ist eigentlich auch wieder selbstsprechend, oder?<br />Leider war bei unserem Besuch die Winterrodelbahn am Blomberg nicht ganz bis zur Talstation befahrbar und auch die Strecke an sich bereits deutlich durch die vielen begeisterten Rodler gekennzeichnet - aber a Gaudi war&#8217;s trotzdem.<br />Wir werden auf jeden Fall wiederkommen&#8230;!<br /><br />Linksammlung<br /><br />Winterrodeln rund um M&uuml;nchen<br /><br />Und hier noch die versprochene Linkliste:<br />	&bull;	<a href="http://www.rodeln.com/Deutschland/deutschland.html" rel="self">Rodeln.com - Deutschland</a><br />	&bull;	<a href="http://www.rodel-tipp.de/" rel="self">Rodel-Tipp.de</a><br />	&bull;	<a href="http://www.robf.de/Rodeln/index.html" rel="self">private Homepage von Robert Widhopf</a> (&#8230;&uuml;ber das Design der Site reden wir mal nicht!)
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2004/12/04/munchner-schlittenberge-am-spitzingsee/">Münchner Schlittenberge - Am Spitzingsee</a></h1>
    
    
      <p class="meta">
        








  


<time datetime="2004-12-04T00:00:00+00:00" pubdate data-updated="true">Dec 4<span>th</span>, 2004</time>
        
      </p>
    
  </header>


  <div class="entry-content">Wie und wo man(n) rund um M&uuml;nchen zum Winterrodeln gehen kann.<br /><br />Nachdem ich in dem ersten Artikel der Reihe &#8220;Schlittenfahren rund um M&uuml;nchen&#8221; &uuml;ber die Winterrodelbahn am Blomberg berichtet habe, m&ouml;chte ich Euch heute von einer noch **viel besseren** Location - in unseren Augen sogar von DER Rodelstrecke in der N&auml;he M&uuml;nchens - berichten, welche wir in diesem Winter (2003/ 2004) bereits mehr als 4x besucht haben - stets mit steigender Begeisterung: der Rodelstrecke am Spitzingsee, genauer bei der Unteren und Oberen Firstalm.<br /><br />Wie kommt man(n) an den Spitzingsee?<br /><br />Mit Hilfe der nebenstehenden Anfahrtskizze sollte diese Frage leicht zu beantworten sein&#8230;<br /><br /><img class="imageStyle" alt="1_91_0ASLmwyKRK-228x" src="/rw-journal/files/mnchner-schlittenberge-am-spitzingsee_1.jpg" width="228" height="298"/><br />Anfahrtskizze M&uuml;nchen - Spitzingsee<br /><br />Auf zur Tour 1&#8230;<br /><img class="imageStyle" alt="1_87_XzpSxEn0Kg-228x" src="/rw-journal/files/mnchner-schlittenberge-am-spitzingsee_2.jpg" width="228" height="171"/><br />Blick auf die Untere Firstalm, fotografiert von der Oberen Firstalm<br /><br />Einmal angekommen liegen dem Rodel-Enthusiasten zwei unterschiedliche - in Kombination sogar drei - Routen zu F&uuml;ssen - und das ist w&ouml;rtlich gemeint, den ohne einen (kleinen) Aufstieg l&auml;uft hier nichts :-)&#8230;.<br /><br />Tour 1: Vom Parkplatz am Skilift zur Unteren Firstalm und dann Abfahrt mit dem Schlitten auf der verschneiten und vereisten(?!) Stra&szlig;e zur&uuml;ck zum Parkplatz. Diese Tour bietet noch zwei Varianten an:<br /><br />Variante a) Aufstieg von der Unteren Firstalm zur Oberen Firstalm und dann diesen Aufstieg wieder hinabrodeln.<br /><br />Variante b) Aufstieg von der Unteren Firstalm zur Oberen Firstalm und dann die Wirtschaftsstra&szlig;e von der Oberen Firstalm zum Spitzing-Sattel hinabrodeln.<br /><br />Oder wie w&auml;re es mit der Tour 2?<br /><br /><img class="imageStyle" alt="1_88_VEuBLWFymP-228x" src="/rw-journal/files/mnchner-schlittenberge-am-spitzingsee_3.jpg" width="228" height="171"/><br />Blick auf die Obere Firstalm, fotografiert von der Unteren Firstalm<br /><br />Aufstieg direkt vom Spitzing-Sattel zur Oberen Firstalm &uuml;ber eine breite aber etwas steilere Wirtschaftsstra&szlig;e als in Tour 1 - aber je steiler der Aufstieg umso rasanter die Abfahrt ;-)&#8230;! Auch in dieser Tour geht die Abfahrt wieder die Stra&szlig;e des Aufstiegs hinunter.<br /><br />Oder doch besser die Tour 3?<br /><br />Die von uns zuletzt mit der gr&ouml;&szlig;ten Begeisterung unternommene Tour verbindet die Vorz&uuml;ge beider Strecken miteinander:<br />zun&auml;chst Aufstieg vom Parkplatz am Skilift zur Unteren Firstalm und weiter zur Oberen Firstalm - dieser Aufstieg ist etwas weniger Steil und damit zum &#8220;warm werden&#8221; besonders geeignet - mit anschliessender Abfahrt &uuml;ber die Wirtschaftsstra&szlig;e der Oberen Firstalm zum Spitzing-Sattel<br />&#8230; und dann nocheinmal Aufstieg vom Spitzing-Sattel direkt zur Oberen Firstalm und anschliessend wieder diese Strecke - weil die bessere(!) zur&uuml;ck zum Spitzing-Sattel. Als einziger Nachteil bleibt der R&uuml;ckweg zum Parkplatz am Skilift zu nennen&#8230; aber der hilft sich wieder in die Geschwindigkeit eines Zweibeiners einzufinden - nach den rasanten Abfahrten auf dem Schlitten ;-))&#8230;<br /><br /><img class="imageStyle" alt="1_86_pYSlqssCcE-228x" src="/rw-journal/files/mnchner-schlittenberge-am-spitzingsee_4.jpg" width="228" height="171"/><br />Abfahrt auf der Wirtschaftsstra&szlig;e der Oberen Firstalm<br /><br />Und hier noch einige weitere Winter-Impressionen vom Spitzingsee<br /><br />&#8230;leider nur mir meinem P800 aufgenommen und darum in schlechter Qualit&auml;t :-(<br /><br /><img class="imageStyle" alt="1_81_Lr0SrBCFwk-195x" src="/rw-journal/files/mnchner-schlittenberge-am-spitzingsee_5.jpg" width="195" height="146"/><br /><br /><img class="imageStyle" alt="1_84_JOWCnft8tS-195x" src="/rw-journal/files/mnchner-schlittenberge-am-spitzingsee_6.jpg" width="195" height="146"/><br /><br /><img class="imageStyle" alt="1_85_h5svVNTZ8y-195x" src="/rw-journal/files/mnchner-schlittenberge-am-spitzingsee_7.jpg" width="195" height="146"/><br /><br /><img class="imageStyle" alt="1_80_O5JIe0eDC7-195x" src="/rw-journal/files/mnchner-schlittenberge-am-spitzingsee_8.jpg" width="195" height="146"/><br /><br />Interessante und n&uuml;tzliche Links<br /><br />&#8230;zu aktuellen Webcam Bildern und Wetterinformationen rund um den Spitzingsee<br /><a href="http://www.schliersee.de/" rel="self">http://www.schliersee.de/</a><br /><a href="http://www.schliersbergalm.de/" rel="self">http://www.schliersbergalm.de/</a><br /><a href="http://www.skischule-spitzingsee.de/" rel="self">http://www.skischule-spitzingsee.de/</a><br /><a href="http://www.spitzingsee.com/" rel="self">http://www.spitzingsee.com/</a><br /><br />
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2004/03/15/iphoto-hack/">iPhoto Hack</a></h1>
    
    
      <p class="meta">
        








  


<time datetime="2004-03-15T00:00:00+00:00" pubdate data-updated="true">Mar 15<span>th</span>, 2004</time>
        
      </p>
    
  </header>


  <div class="entry-content">&#8230;die eigene Panasonic DMC-FZ 10 im iPhoto Import Dialog.<br /><br />Wer sich schon immer dar&uuml;ber ge&auml;rgert hat das Apple in dem iPhoto-Dialog &#8220;Importieren&#8221; (gemeint ist der Import von Fotos einer Digicam) eine Abbildung einer absolut un-stylischen und langweiligen Standardkamera - statt der richtigen Abbildung der automatisch erkannten Kamera (vgl. Ger&auml;teerkennung von iSync - da geht es ja auch) - darstellt findest hier eine kurze Anleitung f&uuml;r das pers&ouml;nliches Customizing von iPhoto, am Beispiel der Panasonic DMC-FZ 10&#8230; <br /><br /><h3>Der Stein des Ansto&szlig;es&#8230;</h3><br /><div class="image-left"><img class="imageStyle" alt="1_76_v9s9zJcz9a-228x" src="/rw-journal/files/iphoto-hack_1.jpg" width="228" height="89"/></div><br />&#8230;besteht aus der nebenstehenden dargestellten Abbildung der absolut un-stylischen Standard-Digicam welche sich in Apples&#8217; iPhoto in dem Dialog &#8220;&#8230;Fotos von der Digicam importieren&#8221; dem Nutzer pr&auml;sentiert.<br /><br /><h3>&#8230;und das Ergebnis des Customizing</h3><br /><img class="imageStyle" alt="1_75_7wl4DMc77H-217x" src="/rw-journal/files/iphoto-hack_2.jpg" width="217" height="137"/><br /><br />Die Panasonic DMC-FZ 10 in dem Import-Dialog von iPhoto<br /><br /><strong>Fazit:</strong><br />&#8230;klar, diese Abbildung muss weg und einer sch&ouml;ne Darstellung der gerade erst (teuer) erworbenen Panasonic DMC-FZ 10 weichen.<br /><br />Ich werde an dieser Stelle nich weiter auf die wirklich geniale Digicam und ihre Eigenschaften eingehen - obgleich nicht nur das 12-fach Zoom mehr als einen Nebensatz verdienen w&uuml;rde - sondern erkl&auml;re im Folgenden wie Du die Standard-Cam gegen (irgen-) Deine Digicam austauschen kannst.<br /><br /><h3>&#8230; das versprochene How-to:</h3><br />Nachdem nun zum einen das Problem erkannt und die &uuml;blichen Zeilen f&uuml;r den Disclaimer spendiert sind kommen wir zur L&ouml;sung:<br /><br />Das Ziel der nachfolgenden Bem&uuml;hungen wird es sein, das iPhoto Application-Package zu &ouml;ffnen und darin zwei Images - genau, diese enhalten &#8220;den Stein des Ansto&szlig;es&#8221; - auszutauschen.<br /><br /><strong>Hinweis(e):</strong><br /><div style="display: inline;color:#FF0000;"><em>* Alle &Auml;nderungen welche Du auf Grund der nachfolgenden Beschreibung an Deiner iPhoto Applikation durchf&uuml;hrst gehen auf Dein eigenes Risiko! Ich &uuml;bernehme KEINERLEI Haftung f&uuml;r die weitere einwandfreie Funktionst&uuml;chtigkeit der Applikation nach dieser Anpassung - obgleich dieser marginale Hack sicherlich keinen bleibenden Schaden an iPhoto hinterlassen wird&#8230;.! Aber diese Zeilen und warnenden Worte m&uuml;ssen heute einfach sein :-(&#8230;.</em></div ><br />* Eine, wenn nicht so gar DIE zwingende Vorraussetzung f&uuml;r die nachfolgenden Schritte ist die Verf&uuml;gbarkeit eines hochaufl&ouml;senden (z.B. in 72dpi) Fotos Deiner Digicam. Du findest das am einfachsten &uuml;ber die Homepage des Herstellers, dort z.B. unter Men&uuml;punkten wie &#8220;Presseinformationen&#8221; bzw. &#8220;Pressefotos&#8221;, oder aber auf Webseiten welche ein detailliertes Review Deiner Kamera durchgef&uuml;hrt haben.<br /><br /><strong>Die Vorarbeiten:</strong><br />* Backup der Anwendung iPhoto durch das erstellen einer Kopie der Applikation in Deinem &#8220;Programme&#8221; Ordner (oder wo auch immer sonst Du iPhoto installiert hast)<br />* &Uuml;berpr&uuml;fe ob Du Punkt 1. durchgef&uuml;hrt hast&#8230; ;-)<br />Um das gro&szlig;e Image zu erstellen:<br />* Mache den Hintergrund Deines Kamerabildes wei&szlig;<br />* &Auml;ndere die Gr&ouml;&szlig;e des Bildes auf 59x58 Pixel<br />* Setze den wei&szlig;en Hintergrund auf Transparent<br />* Speichere das Bild als &#8220;camera.tif&#8221; (LZW TIFF, mit Alpha Channel zur Beibehaltung der Transparenz)<br /><br /><strong>Um das kleine Image zu erstellen:</strong><br />* Verwende das Bild &#8220;camera.tif&#8221; als Bildquelle (z.B. als Kopie)<br />* &Auml;ndere die Gr&ouml;&szlig;e des Bildes auf 20x20 Pixel<br />* Speichere das Bild als &#8220;camera_small.tif&#8221; (LZW TIFF, mit Alpha Channel zur Beibehaltung der Transparenz)<br /><br /><strong>Hinweis:</strong><br />Ich habe f&uuml;r die Arbeiten an den Bilddateien Photoshop Elements 2.0 bzw. meinen pers&ouml;nlichen Favouriten GraphicConverter verwendet. Selbstverst&auml;ndlich sollte auch jedes andere Grafikprogramm dazu in der Lage sein - lediglich bezgl. der Abspeicherung der *.tif Datei mit dem transparenten Hintergrund ist Vorsicht geboten da es hier teilweise zu &Uuml;berraschungen kommen kann - genau: der Hintergrund ist schwarz oder grau aber nicht transparent :-(&#8230;<br /><br /><strong>Die Anpassungen an iPhoto selbst:</strong><br />* Beende iPhoto<br />* &Uuml;berpr&uuml;fe erneut ob Du Punkt 1. der Vorarbeiten (siehe oben) durchgef&uuml;hrt hast&#8230; ;-)<br />* Wechsle in den Finder und in den Ordner &#8220;Programme&#8221; (oder wohin auch immer sonst Du iPhoto installiert hast)<br />* Zeige den Packetinhalt an - rechter Mausklick (bzw. Ctrl. und Mausklick) auf iPhoto und dann &#8220;Paketinhalt anzeigen&#8221; (es &ouml;ffnet sich ein neues Finder-Fenster)<br />* Wechsle in dem neuen Finder-Fenster zu dem Ordner &#8220;Contents/Resources&#8221;<br />* Sicher die Images &#8220;camera.tif&#8221; und &#8220;camera_small.tif&#8221; als Kopie unter &#8220;camera_original.tif&#8221; und &#8220;camera_small_original.tif&#8221;<br />* Kopiere die in den beiden vorangegangenen Schritten erstellen Images in dieses Verzeichnis - Du mu&szlig;t das Ersetzen der beiden Originaldateien best&auml;tigen!<br /><br /><strong>&Uuml;berpr&uuml;fe das Ergebnis Deines iPhoto Customizings:</strong><br />* Starte iPhoto<br />* Wechsle in den Tab &#8220;Importieren&#8221; - eh voil&agrave; Du solltest jetzt das neue Image von Deiner Digicam sehen&#8230; :-)<br /><br /><strong>Meine Images als *.gif Export und *.jpg Vorlage</strong><br /><img class="imageStyle" alt="1_72_qrF7t4UnwT-59x" src="/rw-journal/files/iphoto-hack_3.jpg" width="59" height="58"/><img class="imageStyle" alt="1_73_9CYX2GvQFD-20x" src="/rw-journal/files/iphoto-hack_4.jpg" width="20" height="20"/><br /><img class="imageStyle" alt="1_70_VCp3dMAhLp-59x" src="/rw-journal/files/iphoto-hack_5.jpg" width="59" height="58"/><img class="imageStyle" alt="1_71_dBd7RWIjKC-20x" src="/rw-journal/files/iphoto-hack_6.jpg" width="20" height="20"/><br />
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/2004/01/23/digital-hub/">Digital Hub</a></h1>
    
    
      <p class="meta">
        








  


<time datetime="2004-01-23T00:00:00+00:00" pubdate data-updated="true">Jan 23<span>rd</span>, 2004</time>
        
      </p>
    
  </header>


  <div class="entry-content">&#8230; powered by Apple iSync & Bluetooth Technologie<br /><br />Hier findest Du N&auml;heres zu meinem &#8216;Digital Hub&#8217;, einem Apple Powerbook Titanium, powered by Mac OS X Panther. Durch die Apple-Software &#8220;iSync&#8221; - eine wirklich geniale Synchronisations-Software auf Basis SyncML - dient mir das Powerbook als zentraler &#8216;SyncPoint&#8217;, oder eben &#8216;Digital Hub&#8217;, f&uuml;r den Abgleich von Termin- und Adressdaten zwischen meinem privaten Sony-Ericsson P800 und meinem Business Organizer, einem Palm TungstenT. Dabei dient Bluetooth als Kommunikationsprotokoll.<br /><br /><img class="imageStyle" alt="1_39_FXiZYlT9CV-400x" src="/rw-journal/files/digital-hub_1.jpg" width="400" height="400"/><br />&#8230;Powerbook, P800 & TungstenT<br /><br />Auf dem oben dargestellten Bild ist der &#8216;Digital Hub&#8217; mit seinen Hardware-Komponenten dargestellt. Das Herz bildet mein 15&#8221; Titanium Powerbook welches derzeit unter Mac OS X Panther, also der aktuellsten Version dieses wirklich coolen Betriebssystems, l&auml;uft.<br /><br />Die beiden zu synchronisierenden PDAs bzw. Organizer sind zum einen mein privates Organizer-Handy, ein Sony-Ericsson P800, und mein mein Gesch&auml;fts-Organizer, ein Palm TungstenT.<br /><br />&#8230;die Apple iApps - iSync und iCal<br /><br />Die Synchronisation-Drehscheibe, also den Hub, bildet die Software &#8220;iSync&#8221; von Apple im Zusammenspiel mit den Applikationen &#8220;Adressbook&#8221; f&uuml;r Kontaktdaten (Standardanwendung unter Mac OS X) und &#8220;iCal&#8221; als Kalenderprogramm (auf der iLife Produktfamilie). Alle drei Anwendungen sind kostenlos.<br /><br /><img class="imageStyle" alt="1_41_XQ1NM9tBFs-250x" src="/rw-journal/files/digital-hub_2.jpg" width="250" height="200"/><br />&#8216;Digital Hub&#8217; - powered by Mac OS X, Apple iApps & Bluetooth<br />
</div>
  
  


    </article>
  
  <div class="pagination">
    
    <a href="/blog/archives">Blog Archives</a>
    
    <a class="next" href="/page/9/">Newer &rarr;</a>
    
  </div>
</div>
<aside class="sidebar">
  
    <section>
  <h1>Semantic Web Buch</h1>
  <p><a href="http://entwickler-press.de/ep/psecom,id,2,buchid,185.html"><img src="http://entwickler-press.de/ep/ep_buecher/pspic/cover_normal/12/s_k_Semant4948cdb03caf0.jpg" alt="Semantic Web schnell + kompakt, Matthias Geisler, entwickler.press, 2009" title="Semantic Web schnell + kompakt, Matthias Geisler, entwickler.press, 2009" width="134" height="214"></a></p>
  <p><a href="http://www.amazon.de/Semantic-Web-schnell-Matthias-Geisler/dp/3868020284/ref=sr_1_3?ie=UTF8&amp;s=books&amp;qid=1234040730&amp;sr=8-3">Jetzt kaufen</a> | <a href="/semantic-web-schnell-und-kompakt/">Mehr erfahren</a></p>
</section>
<section>
  <h1>Latest Tweets</h1>
  <ul id="tweets">
    <li class="loading">Status updating&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("matthiasgeisler", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/matthiasgeisler" class="twitter-follow-button" data-show-count="false">Follow @matthiasgeisler</a>
  
</section>


<section>
  <h1>On Delicious</h1>
  <div id="delicious"></div>
  <script type="text/javascript" src="http://feeds.delicious.com/v2/json/semanticdreamer?count=3&amp;sort=date&amp;callback=renderDeliciousLinks"></script>
  <p><a href="http://delicious.com/semanticdreamer">My Delicious Bookmarks &raquo;</a></p>
</section>
<section>
  <h1>Recent Posts</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/2011/12/16/yeah-finally-the-internet-explorer-6-countdownmoving-the-world-off-internet-explorer-6/">Yeah! Finally&#8230; The Internet Explorer 6 Countdown
Moving the world off Internet Explorer 6</a>
      </li>
    
      <li class="post">
        <a href="/2011/12/04/wise-words-abouy-life-by-steve-jobs/">Wise Words abouy Life by Steve Jobs</a>
      </li>
    
      <li class="post">
        <a href="/2011/04/22/was-bedeutet-ubuntu-eigentlich/">Was bedeutet Ubuntu eigentlich?</a>
      </li>
    
      <li class="post">
        <a href="/2011/04/13/wordle-net-word-cloud-from-del-icio-us-tags/">Wordle.net - word cloud from del.icio.us tags</a>
      </li>
    
      <li class="post">
        <a href="/2011/04/11/little-big-berlin-awesome-tilt-shift-video/">&#8220;Little Big Berlin&#8221; - Awesome Tilt-shift Video</a>
      </li>
    
  </ul>
</section>





  
</aside>

    </div>
  </div>
  <footer role="contentinfo"><p>
  Copyright &copy; 2012 - Matthias Geisler -
  <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
  

<script type="text/javascript">
      var disqus_shortname = 'semanticdreamer';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>







  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>





</body>
</html>
