--- 
layout: post
title: iPhoto Hack
tags: 
- Apple und Mac OS X
status: publish
type: post
comments: true
published: true
meta: 
  blogger_blog: pocketscout.blogspot.com
  blogger_permalink: /2004/03/iphoto-hack.html
---
...die eigene Panasonic DMC-FZ 10 im iPhoto Import Dialog.<br /><br />Wer sich schon immer dar&uuml;ber ge&auml;rgert hat das Apple in dem iPhoto-Dialog "Importieren" (gemeint ist der Import von Fotos einer Digicam) eine Abbildung einer absolut un-stylischen und langweiligen Standardkamera - statt der richtigen Abbildung der automatisch erkannten Kamera (vgl. Ger&auml;teerkennung von iSync - da geht es ja auch) - darstellt findest hier eine kurze Anleitung f&uuml;r das pers&ouml;nliches Customizing von iPhoto, am Beispiel der Panasonic DMC-FZ 10... <br /><br /><h3>Der Stein des Ansto&szlig;es...</h3><br /><div class="image-left"><img class="imageStyle" alt="1_76_v9s9zJcz9a-228x" src="{{ root_url }}/rw-journal/files/iphoto-hack_1.jpg" width="228" height="89"/></div><br />...besteht aus der nebenstehenden dargestellten Abbildung der absolut un-stylischen Standard-Digicam welche sich in Apples' iPhoto in dem Dialog "...Fotos von der Digicam importieren" dem Nutzer pr&auml;sentiert.<br /><br /><h3>...und das Ergebnis des Customizing</h3><br /><img class="imageStyle" alt="1_75_7wl4DMc77H-217x" src="{{ root_url }}/rw-journal/files/iphoto-hack_2.jpg" width="217" height="137"/><br /><br />Die Panasonic DMC-FZ 10 in dem Import-Dialog von iPhoto<br /><br /><strong>Fazit:</strong><br />...klar, diese Abbildung muss weg und einer sch&ouml;ne Darstellung der gerade erst (teuer) erworbenen Panasonic DMC-FZ 10 weichen.<br /><br />Ich werde an dieser Stelle nich weiter auf die wirklich geniale Digicam und ihre Eigenschaften eingehen - obgleich nicht nur das 12-fach Zoom mehr als einen Nebensatz verdienen w&uuml;rde - sondern erkl&auml;re im Folgenden wie Du die Standard-Cam gegen (irgen-) Deine Digicam austauschen kannst.<br /><br /><h3>... das versprochene How-to:</h3><br />Nachdem nun zum einen das Problem erkannt und die &uuml;blichen Zeilen f&uuml;r den Disclaimer spendiert sind kommen wir zur L&ouml;sung:<br /><br />Das Ziel der nachfolgenden Bem&uuml;hungen wird es sein, das iPhoto Application-Package zu &ouml;ffnen und darin zwei Images - genau, diese enhalten "den Stein des Ansto&szlig;es" - auszutauschen.<br /><br /><strong>Hinweis(e):</strong><br /><div style="display: inline;color:#FF0000;"><em>* Alle &Auml;nderungen welche Du auf Grund der nachfolgenden Beschreibung an Deiner iPhoto Applikation durchf&uuml;hrst gehen auf Dein eigenes Risiko! Ich &uuml;bernehme KEINERLEI Haftung f&uuml;r die weitere einwandfreie Funktionst&uuml;chtigkeit der Applikation nach dieser Anpassung - obgleich dieser marginale Hack sicherlich keinen bleibenden Schaden an iPhoto hinterlassen wird....! Aber diese Zeilen und warnenden Worte m&uuml;ssen heute einfach sein :-(....</em></div ><br />* Eine, wenn nicht so gar DIE zwingende Vorraussetzung f&uuml;r die nachfolgenden Schritte ist die Verf&uuml;gbarkeit eines hochaufl&ouml;senden (z.B. in 72dpi) Fotos Deiner Digicam. Du findest das am einfachsten &uuml;ber die Homepage des Herstellers, dort z.B. unter Men&uuml;punkten wie "Presseinformationen" bzw. "Pressefotos", oder aber auf Webseiten welche ein detailliertes Review Deiner Kamera durchgef&uuml;hrt haben.<br /><br /><strong>Die Vorarbeiten:</strong><br />* Backup der Anwendung iPhoto durch das erstellen einer Kopie der Applikation in Deinem "Programme" Ordner (oder wo auch immer sonst Du iPhoto installiert hast)<br />* &Uuml;berpr&uuml;fe ob Du Punkt 1. durchgef&uuml;hrt hast... ;-)<br />Um das gro&szlig;e Image zu erstellen:<br />* Mache den Hintergrund Deines Kamerabildes wei&szlig;<br />* &Auml;ndere die Gr&ouml;&szlig;e des Bildes auf 59x58 Pixel<br />* Setze den wei&szlig;en Hintergrund auf Transparent<br />* Speichere das Bild als "camera.tif" (LZW TIFF, mit Alpha Channel zur Beibehaltung der Transparenz)<br /><br /><strong>Um das kleine Image zu erstellen:</strong><br />* Verwende das Bild "camera.tif" als Bildquelle (z.B. als Kopie)<br />* &Auml;ndere die Gr&ouml;&szlig;e des Bildes auf 20x20 Pixel<br />* Speichere das Bild als "camera_small.tif" (LZW TIFF, mit Alpha Channel zur Beibehaltung der Transparenz)<br /><br /><strong>Hinweis:</strong><br />Ich habe f&uuml;r die Arbeiten an den Bilddateien Photoshop Elements 2.0 bzw. meinen pers&ouml;nlichen Favouriten GraphicConverter verwendet. Selbstverst&auml;ndlich sollte auch jedes andere Grafikprogramm dazu in der Lage sein - lediglich bezgl. der Abspeicherung der *.tif Datei mit dem transparenten Hintergrund ist Vorsicht geboten da es hier teilweise zu &Uuml;berraschungen kommen kann - genau: der Hintergrund ist schwarz oder grau aber nicht transparent :-(...<br /><br /><strong>Die Anpassungen an iPhoto selbst:</strong><br />* Beende iPhoto<br />* &Uuml;berpr&uuml;fe erneut ob Du Punkt 1. der Vorarbeiten (siehe oben) durchgef&uuml;hrt hast... ;-)<br />* Wechsle in den Finder und in den Ordner "Programme" (oder wohin auch immer sonst Du iPhoto installiert hast)<br />* Zeige den Packetinhalt an - rechter Mausklick (bzw. Ctrl. und Mausklick) auf iPhoto und dann "Paketinhalt anzeigen" (es &ouml;ffnet sich ein neues Finder-Fenster)<br />* Wechsle in dem neuen Finder-Fenster zu dem Ordner "Contents/Resources"<br />* Sicher die Images "camera.tif" und "camera_small.tif" als Kopie unter "camera_original.tif" und "camera_small_original.tif"<br />* Kopiere die in den beiden vorangegangenen Schritten erstellen Images in dieses Verzeichnis - Du mu&szlig;t das Ersetzen der beiden Originaldateien best&auml;tigen!<br /><br /><strong>&Uuml;berpr&uuml;fe das Ergebnis Deines iPhoto Customizings:</strong><br />* Starte iPhoto<br />* Wechsle in den Tab "Importieren" - eh voil&agrave; Du solltest jetzt das neue Image von Deiner Digicam sehen... :-)<br /><br /><strong>Meine Images als *.gif Export und *.jpg Vorlage</strong><br /><img class="imageStyle" alt="1_72_qrF7t4UnwT-59x" src="{{ root_url }}/rw-journal/files/iphoto-hack_3.jpg" width="59" height="58"/><img class="imageStyle" alt="1_73_9CYX2GvQFD-20x" src="{{ root_url }}/rw-journal/files/iphoto-hack_4.jpg" width="20" height="20"/><br /><img class="imageStyle" alt="1_70_VCp3dMAhLp-59x" src="{{ root_url }}/rw-journal/files/iphoto-hack_5.jpg" width="59" height="58"/><img class="imageStyle" alt="1_71_dBd7RWIjKC-20x" src="{{ root_url }}/rw-journal/files/iphoto-hack_6.jpg" width="20" height="20"/><br />
